function p_out = E_depolarization(p_in, p)
%Функция возвращает матрицу плотности p_out, полученную в результате
%действия амплитудной релаксации с парметрами t и T1
%Параметры:
%   p_in - изначальная матрица плотности
%   t - время измерения
%   T1 - время амплитудной релаксации
    G_1 = [0 1; 1 0];
    G_2 = [0 -1i; 1i 0];
    G_3 = [1 0; 0 -1];
    E_1 = sqrt(1-3*p/4)*eye(2);
    E_2 = sqrt(p)/2*G_1;
    E_3 = sqrt(p)/2*G_2;
    E_4 = sqrt(p)/2*G_3;
    S = log2(length(p_in));
    if S == 1
%         E_1'*E_1+E_2'*E_2+E_3'*E_3+E_4'*E_4
            p_out = E_1*p_in*E_1' + ...
             E_2*p_in*E_2' + ...
             E_3*p_in*E_3' + ...
             E_4*p_in*E_4';
    elseif S == 2  
        error('S>1')
    else
        error('S>2');
    end
end

