function p_out = E_phase(p_in, t, T2)
%Функция возвращает матрицу плотности p_out, полученную в результате
%действия амплитудной релаксации с парметрами t и T1
%Параметры:
%   p_in - изначальная матрица плотности
%   t - время измерения
%   T1 - время амплитудной релаксации
    E0 = [[1 0]
          [0 exp(-t/(2*T2))]];
    E1 = [[0 0]
          [0 sqrt(1-exp(-t/T2))]];
    S = log2(length(p_in));
    if S == 1
        E0'*E0+E1'*E1;
        p_out = E0*p_in*E0' + E1*p_in*E1';
    elseif S == 2  
        E00 = kron(E0,E0);
        E01 = kron(E0,E1);
        E10 = kron(E1,E0);
        E11 = kron(E1,E1);
        E00'*E00+E01'*E01+E10'*E10+E11'*E11;
        p_out = E00*p_in*E00' + E01*p_in*E01' + ...
                E10*p_in*E10' + E11*p_in*E11';
    else
        error('S>2');
    end
end

